namespace WebSiteElectronicMind.ML.Manager
{
    public class TypeEquipmentAutomat
    {
        public readonly Dictionary<string, List<string>> _equipmentCharacteristics = new Dictionary<string, List<string>>
        {
            { "Модульный автомат", new List<string> { "Количество Полюсов", "Номинальный Ток", "Характеристика срабатывания", "ПКС", "Наличие теплового расцепителя", "Производитель", "Серия", "Обозначение на схеме", "Ширина автомата", "Сечение провода" } },
            { "Дифференциальный автомат", new List<string> { "Количество Полюсов", "Номинальный Ток", "Характеристика срабатывания", "ПКС", "Производитель", "Серия", "Ток утечки", "Характеристика срабатывания по диф.току", "Обозначение на схеме", "Сечение провода" } },

            { "УЗО", new List<string> { "Количество Полюсов", "Номинальный Ток", "ПКС", "Производитель", "Ток утечки", "Характеристика срабатывания по диф.току", "Обозначение на схеме", "Сечение провода" } },

            { "Выключатель нагрузки ", new List<string> { "Количество Полюсов", "Номинальный Ток", "Производитель", "Способ установки", "Исполнение Рев Нерев", "Сечение провода" } },
            { "Рубильник", new List<string> { "Количество Полюсов", "Номинальный Ток", "Производитель", "Способ установки", "Исполнение Рев Нерев", "Сечение провода" } },
            { "Силовые автоматы", new List<string> { "Количество Полюсов", "Номинальный Ток", "ПКС", "Производитель", "Серия" } }

            /*
            { "Корпус", new List<string> { "Высота", "Ширина", "Глубина" } },
            { "Разделительная панель", new List<string> { "Высота", "Ширина" } },
            { "Пластрон", new List<string> { "Высота", "Ширина" } },
            { "Цоколь", new List<string> { "Высота", "Ширина" } },
            { "Монтажная панель", new List<string> { "Высота", "Ширина" } },
            { "Крыша", new List<string> { "Ширина", "Глубина" } },
            { "Боковая панель", new List<string> { "Высота", "Глубина" } }
            */
        };
    }
}
